In [2]:
import pandas as pd

In [7]:
# creating dataframe
sensors = [
    {"id": 101, "timestamps": 10.5, "status": "OK",     "Temperature": 98},
    {"id": 102, "timestamps": 11.0, "status": "FAIL",   "Temperature": 105},
    {"id": 103, "timestamps": 10.8, "status": "OK",     "Temperature": 99},
    {"id": 104, "timestamps": 12.1, "status": "WARN",   "Temperature": 102},
    {"id": 105, "timestamps": 10.2, "status": "OK",     "Temperature": 97},
    {"id": 106, "timestamps": 11.4, "status": "FAIL",   "Temperature": 110},
    {"id": 107, "timestamps": 10.9, "status": "OK",     "Temperature": 100}
]

df = pd.DataFrame(sensors)
df

    id  timestamps status  Temperature
0  101        10.5     OK           98
1  102        11.0   FAIL          105
2  103        10.8     OK           99
3  104        12.1   WARN          102
4  105        10.2     OK           97
5  106        11.4   FAIL          110
6  107        10.9     OK          100

In [10]:
# Normal funcs
df.head()
df.tail()
df.describe()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           7 non-null      int64
 1   timestamps   7 non-null      float64
 2   status       7 non-null      object
 3   Temperature  7 non-null      int64
dtypes: float64(1), int64(2), object(1)
memory usage: 352.0+ bytes

In [18]:
# accessing via loc/iloc
df.loc[0,"id"] # --> way to write is [row, col]
df.iloc[0:2,0:4]

    id  timestamps status  Temperature
0  101        10.5     OK           98
1  102        11.0   FAIL          105

In [28]:
# Group by with same operations --> some more operations available (mean, median , nunique, min, max, count, first, last)
df.groupby("status")["Temperature"].agg(sum)

df.groupby("status").agg(
    avg_temperature = ("Temperature", "mean"),
    timestamps = ("timestamps", "mean")
)

C:\Users\ashwi\AppData\Local\Temp\ipykernel_12708\3557257652.py:2: FutureWarning: The provided callable <built-in function sum> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  pd.DataFrame(df.groupby("status")["Temperature"].agg(sum))

        Temperature
status
FAIL            215
OK              394
WARN            102

In [34]:
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda', 'Tom', 'John', 'Anna', 'Peter'],
    'City': ['New York', 'Paris', 'Berlin', 'London', 'Tokyo', 'New York', 'Paris', 'Berlin'],
    'Sales': [100, 200, 300, 400, 500, 100, 200, 300]
}
df = pd.DataFrame(data)

In [36]:
# pivot table
df.pivot_table(index = 'City', columns = 'Name', values = "Sales", aggfunc = 'mean')

Name       Anna   John  Linda  Peter    Tom
City
Berlin      NaN    NaN    NaN  300.0    NaN
London      NaN    NaN  400.0    NaN    NaN
New York    NaN  100.0    NaN    NaN    NaN
Paris     200.0    NaN    NaN    NaN    NaN
Tokyo       NaN    NaN    NaN    NaN  500.0

In [37]:
# sortng values with respect to any numeric columns
df.sort_values(['Sales'])

    Name      City  Sales
0   John  New York    100
5   John  New York    100
6   Anna     Paris    200
1   Anna     Paris    200
7  Peter    Berlin    300
2  Peter    Berlin    300
3  Linda    London    400
4    Tom     Tokyo    500